{"keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"config": {"name": "global_average_pooling2d_1", "trainable": true, "batch_input_shape": [null, 5, 5, 2048], "data_format": "channels_last", "dtype": "float32"}, "class_name": "GlobalAveragePooling2D"}, {"config": {"name": "dense_1", "activity_regularizer": null, "use_bias": true, "activation": "relu", "bias_regularizer": null, "trainable": true, "kernel_regularizer": {"config": {"l1": 0.0, "l2": 0.004999999888241291}, "class_name": "L1L2"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 150, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_1", "trainable": true, "seed": null, "rate": 0.4, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "dense_2", "activity_regularizer": null, "use_bias": true, "activation": "softmax", "bias_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 133, "kernel_constraint": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}]}, "class_name": "Sequential", "backend": "tensorflow"}